Autodesk.Revit.DB.Electrical.WireSize.InUse
Get or set whether the size can be used in sizing.

Autodesk.Revit.DB.Electrical.WireSize.Diameter
Get diameter of wire.

Autodesk.Revit.DB.Electrical.WireSize.Size
Get size symbol of wire.

Autodesk.Revit.DB.Electrical.WireSize.Ampacity
Get ampacity which be used for specifying size, the unit is ampere.

Autodesk.Revit.DB.Electrical.WireSize
Represents specific electrical wire size information.
Remarks: Wire size is defined based on corresponding wire material type and temperature rating type.